%y = [1 0]; %1st column 初值 2nd column 序号
%x = [0 0];
%用R-K方法求出的y1,y2和y3（先相同yx，f运行四阶RK法再直接运行下列代码）
y_x = y; %解析解法初值
h = 0.1; %步长
for n = 4:5
    x(n+1,1)=x(n,1)+h;
    y(n+1,1)=y(n,1)+h/24*(55*f(x(n,1),y(n,1))-59*f(x(n-1,1),y(n-1,1))+37*f(x(n-2,1),y(n-2,1))-9*f(x(n-3,1),y(n-3,1)));
    y_x(n+1,1)=yx(x(n+1,1));
    y(n+1,2)=n; %标序号
    x(n+1,2)=n; %标序号
    y_x(n+1,2)=n; %标序号
end
LB = zeros(n+1,4); %列表输出
LB(:,1)=x(:,1); %x
LB(:,2)=y(:,1); %yn
LB(:,3)=y_x(:,1); %yx
LB(:,4)=abs(LB(:,3)-LB(:,2)); %解析数值解与方法解之差
LB(:,5)=y(:,2); %序号